package com.roshastudio.newsapp.database.NewsDataBase

import android.content.Context
import androidx.room.Database
import androidx.room.Room
import androidx.room.RoomDatabase
import androidx.sqlite.db.SupportSQLiteDatabase
import com.roshastudio.newsapp.BookMarkDao
import com.roshastudio.newsapp.R
import com.roshastudio.newsapp.NewsDao
import com.roshastudio.newsapp.model.BookMarks
import com.roshastudio.newsapp.model.News
import kotlinx.coroutines.CoroutineScope
import kotlinx.coroutines.launch
@Database(entities = [News::class, BookMarks::class],version = 1,exportSchema = false)

public abstract class NewsRoomDatabase:RoomDatabase() {
    abstract fun NewsDao(): NewsDao
    abstract fun BookMarkDao(): BookMarkDao

    private class NewsDatabaseCallback(
        private val scope: CoroutineScope
    ) : RoomDatabase.Callback() {
        override fun onCreate(db: SupportSQLiteDatabase) {
            super.onCreate(db)

        }
        override fun onOpen(db: SupportSQLiteDatabase) {
            super.onOpen(db)
            INSTANCE?.let { database ->
                scope.launch {
                    var newsDao = database.NewsDao()

                    // Delete all content here.
                    newsDao.deleteAll()

                    // Add sample news.
                    var news = News(1, R.drawable.three,"بمناسبت روز جهانی تالاب ها / تالاب هورالعظیم","۱۳ بهمن مصادف با ۲ فوریه،روز جهانی تالابها نام گرفته است. تالابها از جمله مولدترین محیط\u200Cهای جهان\u200C در تنوع زیستی هستند.تالاب هورالعظیم در غرب استان خوزستان در منطقه مرزی دشت آزادگان واقع شده است.هورالعظیم یا کلان\u200Cتالاب با میانگین عمقی ۵ متر از رود کرخه و دجله در عراق تغذیه میشود.")
                       newsDao.insert(news)
                     news = News(2,R.drawable.four,"اینفوگرافیک/ ۱۰راهکار ساده برای\u200Cمقابله با احساسات منفی ناشی از ویروس\u200Cکرونا\n","اینفوگرافیک/ ۱۰راهکار ساده برای\u200Cمقابله با احساسات منفی ناشی از ویروس\u200Cکرونا\n" +
                             "\n")
                    newsDao.insert(news)
                     news = News(3,R.drawable.five,"چاهی که «سعادتمند»\u200Cها برای فوتبال کنده\u200Cاند!\n","هاجم استقلال در حالی به بهانه سه برابر نشدن قراردادش در تمرینات شرکت نمی\u200Cکند که نهاد\u200Cهای قضایی باید با مدیرانی مانند احمد سعادتمند که دوره گذشته با امضای قرارداد\u200Cهای نجومی، انتظارات را بالا برده\u200Cاند برخورد کند.\n" +
                             "به گزارش گروه رسانه های خبرگزاری تسنیم به نقل از جوان، وقتی با مدیر متخلفی که یک شبه تصمیم می\u200Cگیرد قرارداد\u200Cها را بدون هیچ ضابطه و منطقی چند برابر کند، برخورد نمی\u200Cشود و با وجود تأکید نهاد\u200Cهای نظارتی این قرارداد\u200Cهای نجومی اصلاح نمی\u200Cشوند، خروجی\u200Cاش می\u200Cشود اینکه بازیکنان دیگری هم که جا مانده\u200Cاند راه می\u200Cافتند دنبال اینکه تا امضای\u200Cشان را پای چند برابر شدن قراردادشان نیندازند، پای\u200Cشان را به تمرین نمی\u200Cگذارند، مانند مهدی قایدی، مهاجم تأثیرگذار آبی\u200Cها در چند فصل گذشته که پس از بازی با نساجی با حالت قهر دیگر در تمرینات استقلال شرکت نکرده و پیغام و پسغام داده که تا قراردادش اصلاح و نجومی نشود حاضر نیست تمرین کند، آن هم در حالی که تا سال 1402 قرارداد دارد و غیبتش در تمرینات توجیهی ندارد، به خصوص که مسئولان باشگاه می\u200Cگویند نزدیک به 67 درصد قرارداد این فصلش را دریافت کرده و غیبتش ناموجه است.\n" +
                             "\n" +
                             "وقتی از کیسه خلیفه می\u200Cبخشیدند\n" +
                             "\n" +
                             "شهریورماه گذشته وقتی مدیران استقلال در اقدامی عجیب تصمیم گرفتند به جای باشگاه، یکی از طبقات هتل 5 ستاره آزادی را برای مذاکره با بازیکنان و امضای قرارداد\u200Cهای جدید رزرو کنند، خیلی\u200Cها انتقاد کردند که چرا باشگاهی که دفتر دارد باید بازیکنانش برای تمدید یا قرارداد جدید به هتل بیایند. چند ماه بعد، اما زمانی که رقم\u200Cهای نجومی قرارداد\u200Cهایی که احمد سعادتمند، مدیرعامل وقت استقلال زیرشان را امضا کرده بود، فاش شد مشخص شد مذاکرات هتلی چه پشت پرده\u200Cای داشته است. شنیده می\u200Cشود دست و دلبازی\u200Cهای مدیر وقت استقلال از بیت\u200Cالمال آنقدر بی\u200Cحد و مرز بوده که بازیکنان نیز از رقمی که به آن\u200Cها پیشنهاد می\u200Cشده، تعجب می\u200Cکردند. ضمن اینکه رقم پیشنهادی باشگاه بسیار بالاتر از رقمی بوده که آن\u200Cها انتظار داشتند!\n" +
                             "\n" +
                             "آخرین آن هم افشای قرارداد وریا غفوری بود. کاپیتان استقلال در حالی که هنوز با استقلال قرارداد داشت و به صورت طبیعی احتیاجی به مذاکره جدید و امضای قرارداد جدید نبود، اما احمد سعادتمند در اقدامی قابل تأمل که باید مورد توجه نهاد\u200Cهای بازرسی و نظارتی قرار گیرد، قرارداد کاپیتان استقلال را سالانه از 2 میلیارد به 8 میلیارد رساند و یک قرارداد جدید دو ساله با غفوری امضا کرد تا دریافتی کاپیتان آبی\u200Cها در مجموع دو سال به 14 میلیارد برسد و افزایش بیش از سه برابری را نسبت به قرارداد قبلی داشته باشد. غفوری تنها نبود، محمد دانشگر، فرشید اسماعیلی، فرشید باقری و بازیکنان دیگری هم هستند که سعادتمند قرارداد\u200Cهای بالای 10 میلیاردی با آن\u200Cها برای دو سال امضا کرده و قرارداد قبلی\u200Cشان را اصلاح یا تمدید کرده است.\n" +
                             "\n" +
                             "مهدی قایدی هم یکی دیگر از بازیکنانی بود که سعادتمند به او وعده داده بود که قراردادش را اصلاح می\u200Cکند و به چند برابر می\u200Cرساند. این بازیکن در حالی قرارداد 840 میلیونی با استقلال دارد که مدیر سابق آبی\u200Cها به شماره 10 این تیم وعده داده بود قرارداد او را سه برابر خواهد کرد و به سالانه 3 میلیارد خواهد رساند. این در شرایطی است که قایدی با استقلال تا سال 1402 قرارداد دارد و نیازی به یک قرارداد جدید و اصلاح رقم آن نبود.\n" +
                             "\n" +
                             "در ادامه سعادتمند برکنار شد و فرصت نکرد قرارداد قایدی را اصلاح کند. این بدترین خبر ممکن برای مهاجم کوتاه\u200Cقامت آبی\u200Cها بود. این بازیکن وقتی می\u200Cدید بازیکنانی که نصف او هم برای تیم تأثیرگذاری ندارند چند برابرش دریافتی دارند، نمی\u200Cتوانست با این موضوع کنار بیاید و وقتی دید مدیران جدید استقلال نسبت به وعده\u200Cای که سعادتمند داده بود توجهی ندارند، تصمیم گرفت پس از بازی با نساجی در تمرین استقلال غیبت کند تا اینگونه اعتراضش را به گوش باشگاه برساند.\n" +
                             "\n" +
                             "«سعادتمند»\u200Cها محاکمه شوند\n" +
                             "\n" +
                             "در حالی قایدی بیش از یک هفته است که در تمرین استقلال غایب است که پرتوقع کردن بازیکنانی مانند مهاجم استقلال به عملکرد مدیرانی برمی\u200Cگردد که بدون هیچ ضابطه\u200Cای قرارداد\u200Cهای بازیکنان این تیم را در شروع فصل چندبرابر کردند و تا امروز بابت این حیف و میل\u200Cها و بذل و بخشش\u200Cهایی که از بیت\u200Cالمال انجام داده\u200Cاند از سوی هیچ مرجعی برای پاسخگویی احضار نشده\u200Cاند.\n" +
                             "\n" +
                             "در این بین نه قایدی مقصر است و نه غفوری، باید یقه مدیرانی را گرفت که امروز با انداختن چنین آتشی به خرمن استقلال، خودشان کنار رفته\u200Cاند و نظاره\u200Cگر حواشی هستند که با مدیریت آن\u200Cها بر استقلال آوار شده است. در این میان از کم\u200Cکاری مدیران جدید استقلال و البته نهاد\u200Cهای نظارتی هم نباید گذشت. اگرچه سازمان بازرسی در واکنش به قرارداد\u200Cهای نجومی استقلال در زمان مدیریت احمد سعادتمند خواستار کاهش قرارداد\u200Cها شده بود، اما این خواسته هیچگاه از سوی مسئولان فعلی استقلال عملی نشد و رقم\u200Cهای نجومی قرارداد\u200Cها به قوت خود باقی است.\n" +
                             "\n" +
                             "در زمانه بی\u200Cعملی مدیریت استقلال و روی زمین ماندن درخواست سازمان بازرسی، نهاد\u200Cهای نظارتی و قضایی باید ورود جدی\u200Cتری به ریخت و پاش\u200Cهایی که مدیران دولتی فوتبال از بیت\u200Cالمال انجام می\u200Cدهند داشته باشند، به خصوص که وزارت ورزش به عنوان مالک دو باشگاه دولتی استقلال و پرسپولیس تاکنون اراده\u200Cای برای برخورد با مدیران متخلف در این دو باشگاه دولتی نشان نداده است. در قدم اول علاوه بر اصلاح قرارداد\u200Cها باید با مدیران متخلفی که این قرارداد\u200Cها را امضا کرده\u200Cاند برخورد و مدیرانی مانند احمد سعادتمند را به پای میز محاکمه کشاند تا پاسخ دهند با چه مجوزی قرارداد\u200Cها را آن هم در شرایط سخت اقتصادی کشور چند برابر کرده\u200Cاند.\n" +
                             "\n" +
                             "اخبار گروه سایر رسانه\u200Cها صرفا بازنشر اخبار سایت\u200Cها و خبرگزاری\u200Cهاست و خبرگزاری تسنیم هیچ مسئولیتی در قبال آن ندارد.\n" +
                             "\n" +
                             "انتهای پیام/")
                    newsDao.insert(news)
                    news = News(4,R.drawable.six,"بارش برف در ماسوله\n"," ۰۷ اسفند ۱۳۹۹ - ۱۱:۵۰")
                    newsDao.insert(news)



                }
            }
        }
    }
    companion object{

        // preventing multiple instances of database opening at the
        // same time
        @Volatile
        private var INSTANCE: NewsRoomDatabase? = null
        fun  getDatabase(context: Context,scope: CoroutineScope):NewsRoomDatabase{

            return INSTANCE ?: synchronized(this){
                val instance = Room.databaseBuilder(
                    context.applicationContext,
                    NewsRoomDatabase::class.java,
                    "news_database"
                )
                    .addCallback(NewsDatabaseCallback(scope))
                    .build()
                INSTANCE = instance
                // return instance
                instance
            }
        }
    }
}